Autodesk.Revit.DB.Structure.RebarBarType.Create(Autodesk.Revit.DB.Document)
Creates a new RebarBarType object
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.

Autodesk.Revit.DB.Structure.RebarBarType.SetHookOffsetLength(Autodesk.Revit.DB.ElementId,System.Double)
Identifies the hook offset length for a hook type
Remarks:
AutoCalcHookLengths is ignored when this property is set
hookId:
id of the hook type
newLength:
The hook offset length for a hook type
Throws Autodesk.Revit.Exceptions.ArgumentException:
the rebar hook type id hookId is not valid
-or-
the hook specified by id hookId doesn't have valid offset length
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.

Autodesk.Revit.DB.Structure.RebarBarType.SetHookTangentLength(Autodesk.Revit.DB.ElementId,System.Double)
Identifies the hook tangent length for a hook type
Remarks:
AutoCalcHookLengths is ignored when this property is set
hookId:
id of the hook type
newLength:
The hook tangent length for a hook type
Throws Autodesk.Revit.Exceptions.ArgumentException:
the rebar hook type id hookId is not valid
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2014

Autodesk.Revit.DB.Structure.RebarBarType.SetHookLength(Autodesk.Revit.DB.ElementId,System.Double)
Identifies the hook length for a hook type
hookId:
id of the hook type
hookLength:
The hook length for a hook type
Throws Autodesk.Revit.Exceptions.ArgumentException:
the rebar hook type id hookId is not valid
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.

Autodesk.Revit.DB.Structure.RebarBarType.SetAutoCalcHookLengths(Autodesk.Revit.DB.ElementId,System.Boolean)
Identifies if the hook lengths of a hook type are automatically calculated for this bar type
hookId:
id of the hook type
autoCalculated:
True if the hook lengths should be automatically calculated, otherwise false
When it is false, default hook length and default hook offset length will be reported
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.

Autodesk.Revit.DB.Structure.RebarBarType.SetHookPermission(Autodesk.Revit.DB.ElementId,System.Boolean)
Identifies if a hook type is permitted for this bar type
hookId:
id of the hook type
permission:
True if the hook type should be permitted for this bar type, otherwise false
Throws Autodesk.Revit.Exceptions.ArgumentException:
the rebar hook type id hookId is not valid
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.

Autodesk.Revit.DB.Structure.RebarBarType.SetBarTypeDiameters(Autodesk.Revit.DB.BarTypeDiameterOptions)
Sets all input diameters from diametersOptions in current RebarBarType.
diametersOptions:
The input diameters are validated as follows :
barModelDiameter and barNominalDiameter are both positive and no more than the smallest value of 1.0 and the input bend diameters.
Each bend diameter is smaller than 99.0 and bigger than barDiameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the diameters ranges in diametersOptions  are not acceptable.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2018.1

Autodesk.Revit.DB.Structure.RebarBarType.BarNominalDiameter
Defines bar nominal diameter of rebar
The bar nominal diameter of rebar
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: the bar diameter barNominalDiam is not positive or bigger than the smallest value of 1.0, and current internal values of standard bend diameter,
standard hook bend diameter and stirrup/tie bend diameter
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2022

Autodesk.Revit.DB.Structure.RebarBarType.BarModelDiameter
Defines bar model diameter of rebar
The bar model diameter of rebar
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: the bar diameter barModelDiam is not positive or bigger than the smallest value of 1.0, and current internal values of standard bend diameter,
standard hook bend diameter and stirrup/tie bend diameter
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2022